; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
     shaker1 - shaker
     left right - hand
     shot1 shot2 shot3 shot4 shot5 shot6 shot7 shot8 shot9 shot10 shot11 shot12 shot13 shot14 - shot
     ingredient1 ingredient2 ingredient3 ingredient4 ingredient5 ingredient6 ingredient7 - ingredient
     cocktail1 cocktail2 cocktail3 cocktail4 cocktail5 cocktail6 cocktail7 - cocktail
     dispenser1 dispenser2 dispenser3 dispenser4 dispenser5 dispenser6 dispenser7 - dispenser
     l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (ontable shot7)
  (ontable shot8)
  (ontable shot9)
  (ontable shot10)
  (ontable shot11)
  (ontable shot12)
  (ontable shot13)
  (ontable shot14)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (dispenses dispenser4 ingredient4)
  (dispenses dispenser5 ingredient5)
  (dispenses dispenser6 ingredient6)
  (dispenses dispenser7 ingredient7)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (clean shot7)
  (clean shot8)
  (clean shot9)
  (clean shot10)
  (clean shot11)
  (clean shot12)
  (clean shot13)
  (clean shot14)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (empty shot7)
  (empty shot8)
  (empty shot9)
  (empty shot10)
  (empty shot11)
  (empty shot12)
  (empty shot13)
  (empty shot14)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient1)
  (cocktail-part2 cocktail1 ingredient6)
  (cocktail-part1 cocktail2 ingredient5)
  (cocktail-part2 cocktail2 ingredient3)
  (cocktail-part1 cocktail3 ingredient6)
  (cocktail-part2 cocktail3 ingredient1)
  (cocktail-part1 cocktail4 ingredient5)
  (cocktail-part2 cocktail4 ingredient7)
  (cocktail-part1 cocktail5 ingredient7)
  (cocktail-part2 cocktail5 ingredient5)
  (cocktail-part1 cocktail6 ingredient4)
  (cocktail-part2 cocktail6 ingredient1)
  (cocktail-part1 cocktail7 ingredient4)
  (cocktail-part2 cocktail7 ingredient5)
)
 (:goal
  (and
     (contains shot1 cocktail2)
     (contains shot2 cocktail3)
     (contains shot3 cocktail6)
     (contains shot4 cocktail4)
     (contains shot5 cocktail7)
     (contains shot6 cocktail1)
     (contains shot7 cocktail5)
     (contains shot8 cocktail7)
     (contains shot9 ingredient1)
     (contains shot10 ingredient4)
     (contains shot11 cocktail3)
     (contains shot12 cocktail1)
     (contains shot13 ingredient5)
)))

; plan
1. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 0 of 13
2. (fill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10) (clean shot10)
   added: (contains shot10 ingredient4) (used shot10 ingredient4)
   goals met: 1 of 13
3. (pour-shot-to-clean-shaker shot10 ingredient4 shaker1 right l0 l1)
   deleted: (contains shot10 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot10) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 13
4. (refill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10)
   added: (contains shot10 ingredient4)
   goals met: 1 of 13
5. (grasp left shot13)
   deleted: (ontable shot13) (handempty left)
   added: (holding left shot13)
   goals met: 1 of 13
6. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 1 of 13
7. (fill-shot shot13 ingredient5 left right dispenser5)
   deleted: (empty shot13) (clean shot13)
   added: (contains shot13 ingredient5) (used shot13 ingredient5)
   goals met: 2 of 13
8. (pour-shot-to-used-shaker shot13 ingredient5 shaker1 left l1 l2)
   deleted: (contains shot13 ingredient5) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient5) (empty shot13) (shaker-level shaker1 l2)
   goals met: 1 of 13
9. (refill-shot shot13 ingredient5 left right dispenser5)
   deleted: (empty shot13)
   added: (contains shot13 ingredient5)
   goals met: 2 of 13
10. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 2 of 13
11. (leave left shot13)
   deleted: (holding left shot13)
   added: (handempty left) (ontable shot13)
   goals met: 2 of 13
12. (shake cocktail7 ingredient4 ingredient5 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient5)
   added: (shaked shaker1) (contains shaker1 cocktail7)
   goals met: 2 of 13
13. (pour-shaker-to-shot cocktail7 shot5 right shaker1 l2 l1)
   deleted: (clean shot5) (empty shot5) (shaker-level shaker1 l2)
   added: (contains shot5 cocktail7) (shaker-level shaker1 l1)
   goals met: 3 of 13
14. (pour-shaker-to-shot cocktail7 shot8 right shaker1 l1 l0)
   deleted: (clean shot8) (empty shot8) (shaker-level shaker1 l1)
   added: (contains shot8 cocktail7) (shaker-level shaker1 l0)
   goals met: 4 of 13
15. (empty-shaker right shaker1 cocktail7 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail7)
   added: (empty shaker1)
   goals met: 4 of 13
16. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 4 of 13
17. (grasp left shot9)
   deleted: (ontable shot9) (handempty left)
   added: (holding left shot9)
   goals met: 4 of 13
18. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 4 of 13
19. (fill-shot shot9 ingredient1 left right dispenser1)
   deleted: (empty shot9) (clean shot9)
   added: (contains shot9 ingredient1) (used shot9 ingredient1)
   goals met: 5 of 13
20. (pour-shot-to-clean-shaker shot9 ingredient1 shaker1 left l0 l1)
   deleted: (contains shot9 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot9) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 4 of 13
21. (refill-shot shot9 ingredient1 left right dispenser1)
   deleted: (empty shot9)
   added: (contains shot9 ingredient1)
   goals met: 5 of 13
22. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 5 of 13
23. (leave left shot9)
   deleted: (holding left shot9)
   added: (handempty left) (ontable shot9)
   goals met: 5 of 13
24. (fill-shot shot7 ingredient6 right left dispenser6)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient6) (used shot7 ingredient6)
   goals met: 5 of 13
25. (pour-shot-to-used-shaker shot7 ingredient6 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient6) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient6) (empty shot7) (shaker-level shaker1 l2)
   goals met: 5 of 13
26. (clean-shot shot7 ingredient6 right left)
   deleted: (used shot7 ingredient6)
   added: (clean shot7)
   goals met: 5 of 13
27. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 5 of 13
28. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 5 of 13
29. (shake cocktail3 ingredient6 ingredient1 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient6) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail3)
   goals met: 5 of 13
30. (pour-shaker-to-shot cocktail3 shot11 right shaker1 l2 l1)
   deleted: (clean shot11) (empty shot11) (shaker-level shaker1 l2)
   added: (contains shot11 cocktail3) (shaker-level shaker1 l1)
   goals met: 6 of 13
31. (pour-shaker-to-shot cocktail3 shot2 right shaker1 l1 l0)
   deleted: (clean shot2) (empty shot2) (shaker-level shaker1 l1)
   added: (contains shot2 cocktail3) (shaker-level shaker1 l0)
   goals met: 7 of 13
32. (empty-shaker right shaker1 cocktail3 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail3)
   added: (empty shaker1)
   goals met: 7 of 13
33. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 7 of 13
34. (grasp left shot9)
   deleted: (ontable shot9) (handempty left)
   added: (holding left shot9)
   goals met: 7 of 13
35. (pour-shot-to-clean-shaker shot9 ingredient1 shaker1 left l0 l1)
   deleted: (contains shot9 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot9) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 6 of 13
36. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 6 of 13
37. (refill-shot shot9 ingredient1 left right dispenser1)
   deleted: (empty shot9)
   added: (contains shot9 ingredient1)
   goals met: 7 of 13
38. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 7 of 13
39. (leave left shot9)
   deleted: (holding left shot9)
   added: (handempty left) (ontable shot9)
   goals met: 7 of 13
40. (fill-shot shot7 ingredient6 right left dispenser6)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient6) (used shot7 ingredient6)
   goals met: 7 of 13
41. (pour-shot-to-used-shaker shot7 ingredient6 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient6) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient6) (empty shot7) (shaker-level shaker1 l2)
   goals met: 7 of 13
42. (clean-shot shot7 ingredient6 right left)
   deleted: (used shot7 ingredient6)
   added: (clean shot7)
   goals met: 7 of 13
43. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 7 of 13
44. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 7 of 13
45. (shake cocktail1 ingredient1 ingredient6 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient1) (contains shaker1 ingredient6)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 7 of 13
46. (pour-shaker-to-shot cocktail1 shot12 left shaker1 l2 l1)
   deleted: (clean shot12) (empty shot12) (shaker-level shaker1 l2)
   added: (contains shot12 cocktail1) (shaker-level shaker1 l1)
   goals met: 8 of 13
47. (pour-shaker-to-shot cocktail1 shot6 left shaker1 l1 l0)
   deleted: (clean shot6) (empty shot6) (shaker-level shaker1 l1)
   added: (contains shot6 cocktail1) (shaker-level shaker1 l0)
   goals met: 9 of 13
48. (empty-shaker left shaker1 cocktail1 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail1)
   added: (empty shaker1)
   goals met: 9 of 13
49. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 9 of 13
50. (grasp right shot9)
   deleted: (ontable shot9) (handempty right)
   added: (holding right shot9)
   goals met: 9 of 13
51. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 9 of 13
52. (pour-shot-to-clean-shaker shot9 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot9 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot9) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 8 of 13
53. (refill-shot shot9 ingredient1 right left dispenser1)
   deleted: (empty shot9)
   added: (contains shot9 ingredient1)
   goals met: 9 of 13
54. (leave right shot9)
   deleted: (holding right shot9)
   added: (handempty right) (ontable shot9)
   goals met: 9 of 13
55. (grasp right shot10)
   deleted: (ontable shot10) (handempty right)
   added: (holding right shot10)
   goals met: 9 of 13
56. (pour-shot-to-used-shaker shot10 ingredient4 shaker1 right l1 l2)
   deleted: (contains shot10 ingredient4) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient4) (empty shot10) (shaker-level shaker1 l2)
   goals met: 8 of 13
57. (refill-shot shot10 ingredient4 right left dispenser4)
   deleted: (empty shot10)
   added: (contains shot10 ingredient4)
   goals met: 9 of 13
58. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 9 of 13
59. (leave right shot10)
   deleted: (holding right shot10)
   added: (handempty right) (ontable shot10)
   goals met: 9 of 13
60. (shake cocktail6 ingredient4 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail6)
   goals met: 9 of 13
61. (pour-shaker-to-shot cocktail6 shot3 left shaker1 l2 l1)
   deleted: (clean shot3) (empty shot3) (shaker-level shaker1 l2)
   added: (contains shot3 cocktail6) (shaker-level shaker1 l1)
   goals met: 10 of 13
62. (empty-shaker left shaker1 cocktail6 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail6)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 10 of 13
63. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 10 of 13
64. (grasp right shot13)
   deleted: (ontable shot13) (handempty right)
   added: (holding right shot13)
   goals met: 10 of 13
65. (pour-shot-to-clean-shaker shot13 ingredient5 shaker1 right l0 l1)
   deleted: (contains shot13 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot13) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 9 of 13
66. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 9 of 13
67. (clean-shot shot13 ingredient5 right left)
   deleted: (used shot13 ingredient5)
   added: (clean shot13)
   goals met: 9 of 13
68. (fill-shot shot13 ingredient3 right left dispenser3)
   deleted: (empty shot13) (clean shot13)
   added: (contains shot13 ingredient3) (used shot13 ingredient3)
   goals met: 9 of 13
69. (pour-shot-to-used-shaker shot13 ingredient3 shaker1 right l1 l2)
   deleted: (contains shot13 ingredient3) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient3) (empty shot13) (shaker-level shaker1 l2)
   goals met: 9 of 13
70. (clean-shot shot13 ingredient3 right left)
   deleted: (used shot13 ingredient3)
   added: (clean shot13)
   goals met: 9 of 13
71. (fill-shot shot13 ingredient5 right left dispenser5)
   deleted: (empty shot13) (clean shot13)
   added: (contains shot13 ingredient5) (used shot13 ingredient5)
   goals met: 10 of 13
72. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 10 of 13
73. (leave right shot13)
   deleted: (holding right shot13)
   added: (handempty right) (ontable shot13)
   goals met: 10 of 13
74. (shake cocktail2 ingredient5 ingredient3 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient5) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 10 of 13
75. (pour-shaker-to-shot cocktail2 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l2)
   added: (contains shot1 cocktail2) (shaker-level shaker1 l1)
   goals met: 11 of 13
76. (empty-shaker left shaker1 cocktail2 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail2)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 11 of 13
77. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 11 of 13
78. (grasp right shot13)
   deleted: (ontable shot13) (handempty right)
   added: (holding right shot13)
   goals met: 11 of 13
79. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 11 of 13
80. (pour-shot-to-clean-shaker shot13 ingredient5 shaker1 right l0 l1)
   deleted: (contains shot13 ingredient5) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot13) (contains shaker1 ingredient5) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 10 of 13
81. (clean-shot shot13 ingredient5 right left)
   deleted: (used shot13 ingredient5)
   added: (clean shot13)
   goals met: 10 of 13
82. (fill-shot shot13 ingredient7 right left dispenser7)
   deleted: (empty shot13) (clean shot13)
   added: (contains shot13 ingredient7) (used shot13 ingredient7)
   goals met: 10 of 13
83. (pour-shot-to-used-shaker shot13 ingredient7 shaker1 right l1 l2)
   deleted: (contains shot13 ingredient7) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient7) (empty shot13) (shaker-level shaker1 l2)
   goals met: 10 of 13
84. (clean-shot shot13 ingredient7 right left)
   deleted: (used shot13 ingredient7)
   added: (clean shot13)
   goals met: 10 of 13
85. (fill-shot shot13 ingredient5 right left dispenser5)
   deleted: (empty shot13) (clean shot13)
   added: (contains shot13 ingredient5) (used shot13 ingredient5)
   goals met: 11 of 13
86. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 11 of 13
87. (leave right shot13)
   deleted: (holding right shot13)
   added: (handempty right) (ontable shot13)
   goals met: 11 of 13
88. (shake cocktail5 ingredient7 ingredient5 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient7) (contains shaker1 ingredient5)
   added: (shaked shaker1) (contains shaker1 cocktail5)
   goals met: 11 of 13
89. (pour-shaker-to-shot cocktail5 shot7 left shaker1 l2 l1)
   deleted: (clean shot7) (empty shot7) (shaker-level shaker1 l2)
   added: (contains shot7 cocktail5) (shaker-level shaker1 l1)
   goals met: 12 of 13
90. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 12 of 13
91. (grasp left shot14)
   deleted: (ontable shot14) (handempty left)
   added: (holding left shot14)
   goals met: 12 of 13
92. (fill-shot shot14 ingredient7 left right dispenser7)
   deleted: (empty shot14) (clean shot14)
   added: (contains shot14 ingredient7) (used shot14 ingredient7)
   goals met: 12 of 13
93. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 12 of 13
94. (empty-shaker right shaker1 cocktail5 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail5)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 12 of 13
95. (leave left shot14)
   deleted: (holding left shot14)
   added: (handempty left) (ontable shot14)
   goals met: 12 of 13
96. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 12 of 13
97. (grasp left shot14)
   deleted: (ontable shot14) (handempty left)
   added: (holding left shot14)
   goals met: 12 of 13
98. (pour-shot-to-clean-shaker shot14 ingredient7 shaker1 left l0 l1)
   deleted: (contains shot14 ingredient7) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot14) (contains shaker1 ingredient7) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 12 of 13
99. (leave left shot14)
   deleted: (holding left shot14)
   added: (handempty left) (ontable shot14)
   goals met: 12 of 13
100. (grasp left shot13)
   deleted: (ontable shot13) (handempty left)
   added: (holding left shot13)
   goals met: 12 of 13
101. (pour-shot-to-used-shaker shot13 ingredient5 shaker1 left l1 l2)
   deleted: (contains shot13 ingredient5) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient5) (empty shot13) (shaker-level shaker1 l2)
   goals met: 11 of 13
102. (leave left shot13)
   deleted: (holding left shot13)
   added: (handempty left) (ontable shot13)
   goals met: 11 of 13
103. (shake cocktail4 ingredient5 ingredient7 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient5) (contains shaker1 ingredient7)
   added: (shaked shaker1) (contains shaker1 cocktail4)
   goals met: 11 of 13
104. (pour-shaker-to-shot cocktail4 shot4 right shaker1 l2 l1)
   deleted: (clean shot4) (empty shot4) (shaker-level shaker1 l2)
   added: (contains shot4 cocktail4) (shaker-level shaker1 l1)
   goals met: 12 of 13
105. (grasp left shot13)
   deleted: (ontable shot13) (handempty left)
   added: (holding left shot13)
   goals met: 12 of 13
106. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 12 of 13
107. (refill-shot shot13 ingredient5 left right dispenser5)
   deleted: (empty shot13)
   added: (contains shot13 ingredient5)
   goals met: 13 of 13
